#### PipeFlowConfigurationType Enumeration

---

|  |
| --- |
| See Also |

An enumerated type listing all connector flow configuration

**Namespace:**   Autodesk.Revit.DB.Plumbing
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public enum PipeFlowConfigurationType ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration PipeFlowConfigurationType ``` |

| Visual C++ |
| --- |
| ``` public enum class PipeFlowConfigurationType ``` |

# Members

| Member name | Description |
| --- | --- |
| Calculated | Flow configuration is calculated |
| Preset | Flow configuration is Preset |
| System | Flow configuration depends on system |
| Demand | Flow configuration depends on demand |

# See Also

Autodesk.Revit.DB.Plumbing Namespace